# Data Wrangling

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [10]:
khashti = sns.load_dataset("titanic")
khashti.head()
ks1 = khashti
ks2 = khashti

In [3]:
# Single operation (math operator)
(khashti['age']+10).head(10)

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
5     NaN
6    64.0
7    12.0
8    37.0
9    24.0
Name: age, dtype: float64

# 1. Check null values

In [4]:
# where the null values
khashti.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

## 2. Drop missing value in Specific column

In [5]:
khashti.dropna(subset=['deck'],axis=0,inplace=True)

In [6]:
khashti.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

### Drop missing values in whole dataset

In [8]:
khashti = khashti.dropna()
khashti.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [9]:
khashti.shape

(182, 15)

## All the null values are removed.

## Now deal with ks1 dataset

In [11]:
ks1.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

# 3. Replacing missing values with average of that column

In [12]:
mean = ks1['age'].mean()
mean

29.69911764705882

### Replacing nan with mean of data (also updating)

In [13]:
ks1['age'] = ks1['age'].replace(np.nan, mean)

In [14]:
ks1.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

# 4. Data Formating

In [19]:
khashti.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

## Type Casting

#### Change datatypes

In [ ]:
ks1['survived']=khashti['survived'].astype("float64")
ks1.dtypes

#### Convert age into days insted of years

In [24]:
ks1['age'] = ks1['age']*360 
ks1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,2851200.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,4924800.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,3369600.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,4536000.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,4536000.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

#### Rename name of column also

In [37]:
ks1.rename(columns={'age':'age in days'},inplace=True)
ks1.head()

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,2851200.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,4924800.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,3369600.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,4536000.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,4536000.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# 5. Data Normalization

In [38]:
khashti.head()

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,2851200.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,4924800.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,3369600.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,4536000.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,4536000.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [41]:
ks4 = khashti[['age in days','fare']]
ks4.head()

   age in days     fare
0    2851200.0   7.2500
1    4924800.0  71.2833
2    3369600.0   7.9250
3    4536000.0  53.1000
4    4536000.0   8.0500

## Methods of Normalization
#### 1.Simple feature Scaling
        - x(new) = x(old) / x(max)
#### 2.Min Max method
#### 3.Z score (Standard score) -3 to +3
#### 4.Log transformation

#### 1.Simple feature Scaling
        - x(new) = x(old) / x(max)

In [47]:
ks4['fare'] = ks4['fare']/ks4['fare'].max()
# ks4['age in days'] = ks4['age in days']/ks4['age in days'].max()     # dono ko krr sakty han
ks4.head()

C:\Users\AMMARA~1\AppData\Local\Temp/ipykernel_6048/1917380823.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ks4['fare'] = ks4['fare']/ks4['fare'].max()

   age in days      fare
0       0.2750  0.014151
1       0.4750  0.139136
2       0.3250  0.015469
3       0.4375  0.103644
4       0.4375  0.015713

#### 2.Min Max method

#### 3.Z score (Standard score) -3 to +3

#### 4.Log transformation